Revit 2015 API
StructuralSectionIWelded Members
The StructuralSectionIWelded type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from StructuralSection.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BottomFlangeThickness
 Bottom Flange Thickness.
BottomFlangeWidth
 Bottom Flange Width.
CentroidHorizontal
 Distance from centroid to the left extremites along horizontal axis.
 (Inherited from StructuralSectionRectangular.)
CentroidVertical
 Distance from centroid to the upper extremites along vertical axis.
 (Inherited from StructuralSectionRectangular.)
ElasticModulusStrongAxis
 Elastic section modulus about main strong axis for calculation of bending stresses.
 (Inherited from StructuralSectionRectangular.)
ElasticModulusWeakAxis
 Elastic section modulus about main weak axis for calculation of bending stresses.
 (Inherited from StructuralSectionRectangular.)
Height
 Section height, depth.
 (Inherited from StructuralSectionRectangular.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from StructuralSection.)
MomentOfInertiaStrongAxis
 Moment of Inertia about main strong axis (I).
 (Inherited from StructuralSectionRectangular.)
MomentOfInertiaWeakAxis
 Moment of Inertia about main weak axis (I).
 (Inherited from StructuralSectionRectangular.)
NominalWeight
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
 (Inherited from StructuralSectionRectangular.)
Perimeter
 Painting surface of the unit length.
 (Inherited from StructuralSectionRectangular.)
PlasticModulusStrongAxis
 Plastic section modulus in bending about main strong axis (Z, Wpl)
 (Inherited from StructuralSectionRectangular.)
PlasticModulusWeakAxis
 Plastic section modulus in bending about main weak axis.
 (Inherited from StructuralSectionRectangular.)
PrincipalAxesAngle
 Rotation angle between the principal axes and cross section reference planes.
 (Inherited from StructuralSectionRectangular.)
SectionArea
 Cross section area.
 (Inherited from StructuralSectionRectangular.)
ShearAreaStrongAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
 (Inherited from StructuralSectionRectangular.)
ShearAreaWeakAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
 (Inherited from StructuralSectionRectangular.)
StructuralSectionShape
 The type of structural section shape.
 (Inherited from StructuralSection.)
StructuralSectionShapeName
 A human readable string representing the structural section shape.
 (Inherited from StructuralSection.)
TopFlangeThickness
 Top Flange Thickness.
TopFlangeWidth
 Top Flange Width.
TorsionalModulus
 Section modulus for calculations of torsion stresses (Ct)
 (Inherited from StructuralSectionRectangular.)
TorsionalMomentOfInertia
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
 (Inherited from StructuralSectionRectangular.)
WarpingConstant
 Warping constant (Cw, Iomega, H)
 (Inherited from StructuralSectionRectangular.)
WebHeight
 Web Height.
WebThickness
 Web Thickness.
Width
 Section width.
 (Inherited from StructuralSectionRectangular.)
See Also
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace